from aiogram import Router, F
from aiogram.types import Message
from keyboards.reply import central_menu, game_options

router = Router()

@router.message(F.text == "🎯 Игровой раздел")
async def display_games(message: Message):
    await message.answer("Доступные игры:", reply_markup=game_options)

@router.message(F.text == "📋 Информация о боте")
async def bot_description(message: Message):
    await message.answer(
        "🤖 *Бот-развлечение с разнообразным функционалом:*\n\n"

        "👤 <b>Профиль пользователя</b>\n"
        "• Создайте и настройте персональный профиль\n"
        "• Храните информацию о себе в удобном формате\n"
        "• Просматривайте свои данные в любое время\n\n"

        "🎮 <b>Игровой раздел</b>\n"
        "🪨 <i>«Камень-Ножницы-Бумага»</i>\n"
        "• Сделайте выбор из трех классических вариантов\n"
        "• Бот также делает случайный выбор\n"
        "• Побеждает по принципу: камень бьёт ножницы, ножницы режут бумагу, бумага накрывает камень\n\n"

        "🎲 <i>Угадывание результата броска</i>\n"
        "• Попробуйте предсказать число от 1 до 6\n"
        "• Бот имитирует случайный бросок виртуального кубика\n"
        "• Точное совпадение приносит победу! 🎯\n\n"

        "👑 <b>Энциклопедия Принцесс Диснея</b>\n"
        "• Узнайте о ваших любимых героинях\n"
        "• История, характер и приключения\n"
        "• Красочные описания и интересные факты\n\n"

        "✨ <i>Наслаждайтесь разнообразными возможностями бота!</i> 😊",
        reply_markup=central_menu,
        parse_mode="HTML"
    )

@router.message(F.text == "🔙 В меню")
async def return_to_menu(message: Message):
    await message.answer("Основное меню:", reply_markup=central_menu)

@router.message(F.text == "🔙 К играм")
async def return_to_game_selection(message: Message):
    await message.answer("Выбор игры:", reply_markup=game_options)